/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Operaci nelze dokončit";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Vyskytla se neznámá chyba (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Akci nelze dokončit";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Zkuste to znovu později.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Nelze zaznamenávat";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Zkuste opakovat záznam.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Nelze zaznamenávat";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Zastavte všechny ostatní akce, které se zařízením „%@“ pracují, a zkuste to znovu."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Nelze zaznamenávat";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Zkuste opakovat záznam.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Záznam zastaven";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Zkuste opakovat záznam.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operace zastavena";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Na disku není dost místa pro pokračování zápisu souboru. Uvolněte místo smazáním nějakých videí nebo obrázků.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Záznam zastaven";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Zkuste opakovat záznam.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Záznam zastaven";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Zkuste opakovat záznam.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Záznam zastaven";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Záznam dosáhl maximální přípustné délky."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Záznam zastaven";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Záznam dosáhl maximální přípustné velikosti souboru."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Záznam zastaven";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Zastavte všechny ostatní akce, které pracují se záznamovým zařízením, a zkuste to znovu.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Záznam zastaven";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Záznam dosáhl maximální přípustné délky."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Nelze zaznamenávat";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Zkuste opakovat záznam.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Zařízení %@ nelze použít"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Zastavte všechny ostatní akce, které se zařízením „%@“ pracují, a zkuste to znovu."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Zařízení %@ nelze použít"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Zastavte všechny ostatní akce, které se zařízením „%@“ pracují, a zkuste to znovu."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Záznam zastaven";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Zastavte všechny ostatní akce, které pracují se záznamovým zařízením, a zkuste to znovu.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "Reflektor se nepodařilo zapnout.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Zkuste reflektor nastavit na nižší intenzitu osvětlení.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Akci nelze dokončit";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Zkuste to znovu později.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Export nelze dokončit";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Zkuste exportovat znovu.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Nelze dekódovat";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Médium nelze dekódovat. Může být poškozené.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Formát média není podporovaný.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Nelze uložit";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Zkuste uložit znovu.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Výstupní soubor nelze zapsat";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Změňte příponu výstupního souboru a zkuste to znovu.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Toto médium nelze použít.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Toto médium nelze použít.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Toto médium nelze použít.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Toto médium nelze použít.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Formát média není podporovaný.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Médium může být poškozené.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Obrázek nelze pořídit";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Zkuste pořídit obrázek znovu.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operace zastavena";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Tato operace není na chráněném obsahu podporována."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Tento obsah není autorizovaný."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Aplikace nemá oprávnění k přehrání tohoto souboru."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Toto médium nelze použít.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Nelze dekódovat";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Dekodér požadovaný pro toto médium nelze nalézt.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Nelze kódovat";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Kodér požadovaný pro toto médium nelze nalézt.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Nelze dekódovat";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Dekodér požadovaný pro toto médium je zaneprázdněný.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Zastavte všechny ostatní akce, které dekódují média, a zkuste to znovu.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Nelze kódovat";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Kodér požadovaný pro toto médium je zaneprázdněný.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Zastavte všechny ostatní akce, které kódují média, a zkuste to znovu.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Zařízení %@ nelze použít"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Zařízení %@ nemůže být používáno aplikací běžící v pozadí."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operace zastavena";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Tato operace není na tomto médiu podporována.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operace zastavena";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Video nelze podle zadaných instrukcí sestavit.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Toto médium nelze použít.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operace zastavena";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Soubor cache na cílovém URL stahování nelze použít.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "Operace zastavena";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "Soubor má neplatný kontrolní součet.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "Operace byla přerušena";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Zastavte ostatní operace a zkuste to znovu.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Nelze otevřít";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "Toto médium nelze na tomto zařízení použít.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "Operace zastavena";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "Médium může být poškozené.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "Operace zastavena";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "Server není správně nakonfigurován.";
